# brew "bash"
# brew "openssl@3"
# brew "unbound"
# brew "gnutls"
# brew "emacs"
# brew "cask"

brew "git"
brew "jj"

# 
# https://github.com/ajeetdsouza/zoxide
brew "zoxide"

# Will be part of `install_colima_docker.sh`
# brew "colima"
# brew "docker"
# brew "docker-compose"
# brew "docker-credential-helper"

# Python
brew "pyenv"

# brew "jenv"

# Java
brew "maven"

# Node, Angular
brew "nvm"

# brew "mono"

# Linux Utils
brew "eza"
# brew "fzf"
brew "xz"
brew "tcl-tk"
brew "tldr"
brew "tmux"
brew "zlib"

# Shell
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Browser
cask "google-chrome"
cask "firefox"

# IDE
cask "intellij-idea-ce"
cask "visual-studio-code"
cask "android-studio"
cask "dbeaver-community"
cask "postman"

# cask "blackhole-2ch"

cask "gimp"

# cask "iterm2"

cask "keepassxc"
cask "notion"

cask "raycast"
cask "snipaste"
cask "sublime-text"

cask "vlc"
cask "zoom"

# vscode "angular.ng-template"
# vscode "christian-kohler.npm-intellisense"
# vscode "dart-code.dart-code"
# vscode "dart-code.flutter"
# vscode "github.copilot"
# vscode "github.copilot-chat"
# vscode "johnpapa.angular2"
# vscode "mikael.angular-beastcode"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.debugpy"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-vscode-remote.remote-containers"
# vscode "nash.awesome-flutter-snippets"
# vscode "nrwl.angular-console"
# vscode "pkief.material-icon-theme"
# vscode "postman.postman-for-vscode"
# vscode "redhat.java"
# vscode "visualstudioexptteam.intellicode-api-usage-examples"
# vscode "visualstudioexptteam.vscodeintellicode"
# vscode "vscjava.vscode-gradle"
# vscode "vscjava.vscode-java-debug"
# vscode "vscjava.vscode-java-dependency"
# vscode "vscjava.vscode-java-pack"
# vscode "vscjava.vscode-java-test"
# vscode "vscjava.vscode-maven"
